import { Injectable } from '@angular/core';
import { 试验批次 } from '../model/试验批次';
import { 数据中心模版 } from './数据中心模版 ';
import * as moment from 'moment';
import { 批次试验数据 } from '../model/批次试验数据';
import { 批次阴性数据 } from '../model/批次阴性数据';

@Injectable({
  providedIn: 'root'
})
export class MockdbService extends 数据中心模版 {
  public 是否已经连接数据库: boolean;

  连接数据库(): void {
    console.log("模拟连接成功")
  }

  查询<T>(sql: string): Promise<T> {
    // let 批次列表: 批次试验数据[] = [
    //   { "批次": "批次1", "创建日期": moment("2021/1/1 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.25, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次2", "创建日期": moment("2021/1/2 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.26, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次3", "创建日期": moment("2021/1/3 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.27, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次4", "创建日期": moment("2021/1/4 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.28, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次5", "创建日期": moment("2021/1/5 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.29, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次6", "创建日期": moment("2021/1/6 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.3, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次7", "创建日期": moment("2021/1/7 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.31, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次8", "创建日期": moment("2021/1/8 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.32, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次9", "创建日期": moment("2021/1/9 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.33, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次10", "创建日期": moment("2021/1/10 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.34, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次11", "创建日期": moment("2021/1/11 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.35, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次12", "创建日期": moment("2021/1/12 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.36, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次13", "创建日期": moment("2021/1/13 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.37, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次14", "创建日期": moment("2021/1/14 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.38, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次15", "创建日期": moment("2021/1/15 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.39, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次16", "创建日期": moment("2021/1/16 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.4, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次17", "创建日期": moment("2021/1/17 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.41, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次18", "创建日期": moment("2021/1/18 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.5, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次19", "创建日期": moment("2021/1/19 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.6, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次20", "创建日期": moment("2021/1/20 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.43, "样品批号": "qc_样品批次1" }
    //   ,
    //   { "批次": "批次21", "创建日期": moment("2021/1/21 11:11").toDate(), "试剂名": "HBsAg", "试剂批号": "仪器批次1", "操作人": "张三", "测量值": 0.44, "样品批号": "qc_样品批次1" }
    // ]

    return Promise.resolve([] as any)
  }

  查询阴性数据(sql: string): Promise<批次阴性数据[]> {
    let 阴性列表: 批次阴性数据[] = [
      { "批次": "批次1", "阴性值": 0.105 }
      ,
      { "批次": "批次2", "阴性值": 0.105 }
      ,
      { "批次": "批次3", "阴性值": 0.105 }
      ,
      { "批次": "批次4", "阴性值": 0.105 }
      ,
      { "批次": "批次5", "阴性值": 0.105 }
      ,
      { "批次": "批次6", "阴性值": 0.105 }
      ,
      { "批次": "批次7", "阴性值": 0.105 }
      ,
      { "批次": "批次8", "阴性值": 0.105 }
      ,
      { "批次": "批次9", "阴性值": 0.105 }
      ,
      { "批次": "批次10", "阴性值": 0.105 }
      ,
      { "批次": "批次11", "阴性值": 0.105 }
      ,
      { "批次": "批次12", "阴性值": 0.105 }
      ,
      { "批次": "批次13", "阴性值": 0.105 }
      ,
      { "批次": "批次14", "阴性值": 0.105 }
      ,
      { "批次": "批次15", "阴性值": 0.105 }
      ,
      { "批次": "批次16", "阴性值": 0.105 }
      ,
      { "批次": "批次17", "阴性值": 0.105 }
      ,
      { "批次": "批次18", "阴性值": 0.105 }
      ,
      { "批次": "批次19", "阴性值": 0.105 }
      ,
      { "批次": "批次20", "阴性值": 0.105 }
      ,
      { "批次": "批次21", "阴性值": 0.105 }

    ]
    return Promise.resolve(阴性列表)
  }

  测试查询(): Promise<any> {
    return Promise.resolve([])
  }
}
